
Процедура ПередУдалением(Отказ)
	МенеджерЗаписиНапоминания = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
	МенеджерЗаписиНапоминания.Элемент = Ссылка;
	МенеджерЗаписиНапоминания.Прочитать();
	Если МенеджерЗаписиНапоминания.ДатаНапоминания <> Дата(1,1,1) Тогда
		ОбщийВызовСервера.ЗаписатьНовоеЗначениеКонстанты("ПерезаписатьНапоминания",истина);	
	КонецЕсли;
	МенеджерЗаписиНапоминания.Удалить();
	
	МенеджерЗаписиПорядокЭлементов = РегистрыСведений.ПорядокЭлементовВРазделах.СоздатьМенеджерЗаписи();
	МенеджерЗаписиПорядокЭлементов.Элемент = Ссылка;
	МенеджерЗаписиПорядокЭлементов.Удалить();	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Ссылка.Пустая() Тогда
		нСсылка = справочники.ЭлементыДоски.ПолучитьСсылку();
		УстановитьСсылкуНового(нСсылка);
	КонецЕсли;          
	МенЗап = РегистрыСведений.ПорядокЭлементовВРазделах.СоздатьМенеджерЗаписи();
	МенЗап.Элемент = Ссылка;
	МенЗап.Прочитать();
	Если МенЗап.Порядок = 0 Тогда
		МенЗап.Элемент = Ссылка;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ПорядокЭлементовВразделах.Порядок), 0) КАК Порядок
		|ИЗ
		|	РегистрСведений.ПорядокЭлементовВразделах КАК ПорядокЭлементовВразделах
		|ГДЕ
		|	ПорядокЭлементовВразделах.Элемент.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Следующий() Тогда
			последнийНомер = ВыборкаЗапроса.Порядок;	
		иначе
			последнийНомер = 0;	
		КонецЕсли;
		МенЗап.Порядок = последнийНомер + 1;
		МенЗап.Записать();
	КонецЕсли;
КонецПроцедуры
