
Процедура ПередЗаписью(Отказ)
	Если ПометкаУдаления Тогда
		ВыборкаЭлементов = справочники.ЭлементыДоски.Выбрать(,Ссылка);
		Если ВыборкаЭлементов.Следующий() Тогда
			сообщить("По данному разделу существуют неудаленные элементы! Удаление отменено");
			отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)//Ден  2016 10 17 ---
	ВыборкаЭлементов = справочники.ЭлементыДоски.Выбрать(,Ссылка);
	Если ВыборкаЭлементов.Следующий() Тогда
		сообщить("По данному разделу существуют неудаленные элементы! Удаление отменено");
		отказ = Истина;
	КонецЕсли;
КонецПроцедуры
