
Процедура ПередЗаписью(Отказ)
	Если ПометкаУдаления Тогда
		ВыборкаЭлементов = справочники.ЭлементыДоски.Выбрать(,Ссылка);
		Если ВыборкаЭлементов.Следующий() Тогда
			сообщить("По данному разделу существуют неудаленные элементы! Удаление отменено");
			отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ВыборкаЭлементов = справочники.ЭлементыДоски.Выбрать(,Ссылка);
	Если ВыборкаЭлементов.Следующий() Тогда
		Сообщить("По данному разделу существуют неудаленные элементы! Удаление отменено");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
