функция ПолучитьНапоминанияДляОповещений() Экспорт//Ден  2016 10 11 ---
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Напоминания.ДатаНапоминания КАК ДатаНапоминания,
	|	Напоминания.Элемент КАК Элемент,
	|	Напоминания.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.ДатаНапоминания >= &ДатаНапоминания";	
	Запрос.УстановитьПараметр("ДатаНапоминания", ТекущаяДата());	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	массивВозврата = новый Массив;
	
	Пока РезультатЗапроса.Следующий() Цикл
		массивВозврата.Добавить(новый Структура("ДатаНапоминания,Элемент,Комментарий",РезультатЗапроса.ДатаНапоминания,РезультатЗапроса.Элемент,РезультатЗапроса.Комментарий));
	КонецЦикла;
	
	возврат массивВозврата;
КонецФункции

функция ПолучитьПросроченныеНапоминания() Экспорт//Ден  2016 10 11 --- 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Напоминания.ДатаНапоминания) КАК КоличествоНапоминаний
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.ДатаНапоминания < &ДатаНапоминания";
	
	Запрос.УстановитьПараметр("ДатаНапоминания", ТекущаяДата()-Константы.МинутОтсрочкиПовторногоНапоминания.Получить()*60);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Следующий() Тогда
		возврат ВыборкаЗапроса.КоличествоНапоминаний;
	иначе
		возврат 0;
	КонецЕсли;	
КонецФункции

функция ПолучитьЗначениеКонстанты(Константа) Экспорт//Ден  2016 10 11 --- 
	возврат Константы[Константа].Получить();
КонецФункции

процедура ЗаписатьНовоеЗначениеКонстанты(Константа,Значение) Экспорт//Ден  2016 10 11 --- 
	Константы[Константа].Установить(Значение);
КонецПроцедуры
