функция ПолучитьНапоминанияСервер() Экспорт//Ден  2016 10 11 ---
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Напоминания.ДатаНапоминания КАК ДатаНапоминания,
	|	Напоминания.Элемент КАК Элемент,
	|	Напоминания.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.ДатаНапоминания >= &ДатаНапоминания";	
	Запрос.УстановитьПараметр("ДатаНапоминания", ТекущаяДата());	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	массивВозврата = новый Массив;
	
	Пока РезультатЗапроса.Следующий() Цикл
		массивВозврата.Добавить(новый Структура("ДатаНапоминания,Элемент,Комментарий",РезультатЗапроса.ДатаНапоминания,РезультатЗапроса.Элемент,РезультатЗапроса.Комментарий));
	КонецЦикла;
	
	возврат массивВозврата;
	
КонецФункции

функция ПроверитьНапоминанияСервер() Экспорт//Ден  2016 10 11 --- 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Напоминания.ДатаНапоминания КАК ДатаНапоминания
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.ДатаНапоминания < &ДатаНапоминания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНапоминания УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНапоминания", ТекущаяДата()-константы.МинутОтсрочкиПовторногоНапоминания.Получить()*60);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Следующий() Тогда
		возврат истина;
	иначе
		возврат ложь;
	КонецЕсли;
	
КонецФункции

функция ПолучитьЗначениеКонстанты(Константа) Экспорт//Ден  2016 10 11 --- 
	возврат константы[Константа].Получить();
КонецФункции

процедура ЗаписатьНовоеЗначениеКонстанты(Константа,Значение) Экспорт//Ден  2016 10 11 --- 
	константы[Константа].Установить(Значение);
КонецПроцедуры
