
Процедура ПриНачалеРаботыСистемы()
	#Если МобильноеПриложениеКлиент Тогда
		ДоставляемыеУведомления.ПодключитьОбработчикУведомлений("ПриПолученииУведомления");
	#КонецЕсли
	ПодключитьОбработчикОжидания("ПроверитьПросроченныеНапоминания", 300);
	ПодключитьОбработчикОжидания("ПерезаписатьНапоминания",60);
КонецПроцедуры

Процедура ПриПолученииУведомления(Уведомление,Локальное,Показано) Экспорт	
	ТекущееОкноНапоминаний = НайтиОкноПоНавигационнойСсылке("Напоминания");
	если ТекущееОкноНапоминаний = неопределено тогда
		ФормаНапоминаний = ПолучитьФорму("РегистрСведений.Напоминания.Форма.ФормаНапоминаний");
		ФормаНапоминаний.НавигационнаяСсылка = "Напоминания";
		ФормаНапоминаний.Открыть();
	иначе
		ТекущееОкноНапоминаний.Активизировать();
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьПросроченныеНапоминания() экспорт//Ден  2016 10 11 ---
	#Если МобильноеПриложениеКлиент Тогда
	КоличествоПросроченныхНапоминаний = ОбщийВызовСервера.ПолучитьПросроченныеНапоминания();	
	Если КоличествоПросроченныхНапоминаний <> 0 Тогда
		уведомление = новый ДоставляемоеУведомление;
		уведомление.Текст = "Имеются просроченные уведомления" + КоличествоПросроченныхНапоминаний;
		уведомление.Заголовок = "Имеются просроченные уведомления" + КоличествоПросроченныхНапоминаний;
		уведомление.ДатаПоявленияУниверсальноеВремя = '00010101';
		ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(уведомление); 	  
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Процедура ПерезаписатьНапоминания() экспорт
	Если ОбщийВызовСервера.ПолучитьЗначениеКонстанты("ПерезаписатьНапоминания") = Ложь Тогда
		Возврат;
	КонецЕсли;
	попытка
		#Если МобильноеПриложениеКлиент Тогда
			ДоставляемыеУведомления.ОтменитьЛокальныеУведомления();
			МассивУведомлений = ОбщийВызовСервера.ПолучитьНапоминанияДляОповещений();
			Если МассивУведомлений.количество() Тогда
				для каждого напоминание из МассивУведомлений цикл
					Уведомление = новый ДоставляемоеУведомление;
					Уведомление.Текст = строка(напоминание.элемент);
					Уведомление.Заголовок = ?(напоминание.Комментарий = "",строка(напоминание.элемент),напоминание.Комментарий);
					Уведомление.Данные = Строка(напоминание.элемент);
					Уведомление.ДатаПоявленияУниверсальноеВремя = УниверсальноеВремя(напоминание.ДатаНапоминания);
					ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(уведомление);
				КонецЦикла;
			КонецЕсли;
		#КонецЕсли
	исключение
		сообщить("Ошибка при процедуре перезаписи напоминаний");
		сообщить(ОписаниеОшибки());
	КонецПопытки;
	ОбщийВызовСервера.ЗаписатьНовоеЗначениеКонстанты("ПерезаписатьНапоминания",ложь);	
КонецПроцедуры
