
&НаКлиенте
Процедура ПриОткрытии(Отказ)//Ден  2016 10 14
	#Если МобильноеПриложениеКлиент Тогда
		Если объект.ссылка.Пустая() Тогда
			этаформа.ТекущийЭлемент = элементы.Наименование;
			НачатьРедактированиеЭлемента();
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)//Ден  2016 10 14
	#Если МобильноеПриложениеКлиент Тогда
		Если объект.ссылка.Пустая() и объект.Порядок = 0 Тогда
			этаформа.ТекущийЭлемент = элементы.Порядок;
			НачатьРедактированиеЭлемента();
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры
