
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)//Ден  2016 10 13 ---
	попытка
		//Удаление старого напоминания
		МенЗап = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
		МенЗап.Комментарий = запись.Комментарий;
		МенЗап.Элемент = запись.Элемент;
		МенЗап.Удалить();
	исключение
		сообщить("Ошибка перез записью на сервере формы");
		сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)//Ден  2016 10 14
	ОбщийВызовСервера.ЗаписатьНовоеЗначениеКонстанты("ПерезаписатьНапоминания",истина);
	Оповестить("Добавление элемента в раздел",Запись.Элемент);
КонецПроцедуры

&НаСервере
Процедура УдалитьНапоминаниеНаСервере(УдалятьЭлемент)//Ден  2016 10 31 ---
	
	Если УдалятьЭлемент Тогда
		ЭлемОбъект = запись.Элемент.ПолучитьОбъект();
		ЭлемОбъект.Удалить();
		Возврат;
	КонецЕсли;
	МенЗап = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
	МенЗап.Комментарий = запись.Комментарий;
	МенЗап.Элемент = запись.Элемент;
	МенЗап.Удалить();
	
	Если ЗначениеЗаполнено(запись.Периодичность) Тогда
		МенЗап = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
		МенЗап.Комментарий = запись.Комментарий;
		МенЗап.Элемент = запись.Элемент;
		Если запись.Периодичность = "Час" Тогда
			МенЗап.ДатаНапоминания = ТекущаяДата() + 3600;//Просто увеличиваем на час
		ИначеЕсли запись.Периодичность = "День" Тогда
			МенЗап.ДатаНапоминания = запись.ИзначальнаяДата + 24*3600 + (запись.ВремяНапоминания - дата(1,1,1)); //На завтра на указанное время
		ИначеЕсли запись.Периодичность = "Неделя" Тогда// На следующую неделю на указанное время
			МенЗап.ДатаНапоминания = запись.ИзначальнаяДата + 7*24*3600 + (запись.ВремяНапоминания - дата(1,1,1));
		ИначеЕсли запись.Периодичность = "Месяц" Тогда// На следующий месяц на указанное время
			МенЗап.ДатаНапоминания = ДобавитьМесяц(запись.ИзначальнаяДата,1) + (запись.ВремяНапоминания - дата(1,1,1));		
		КонецЕсли;
		МенЗап.ИзначальнаяДата = МенЗап.ДатаНапоминания;
		МенЗап.ВремяНапоминания = запись.ВремяНапоминания;
		МенЗап.Периодичность = запись.Периодичность;
		МенЗап.Записать();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНапоминание(Команда)//Ден  2016 10 31 ---
	Если Периодическое Тогда
		УдалитьНапоминаниеПослеОтвета(ложь);
	Иначе	
		ПоказатьВопрос(новый ОписаниеОповещения("УдалитьНапоминаниеПослеОтвета",ЭтотОбъект),"Удалить так же элемент раздела?",РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНапоминаниеПослеОтвета(РезультатВопроса,ДополнительныеПараметры = ложь) экспорт //Ден  2016 10 31 ---
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;	
	Модифицированность = ложь;
	попытка
		УдалитьНапоминаниеНаСервере(?(РезультатВопроса = КодВозвратаДиалога.Да,истина,ложь));
		ОбщийВызовСервера.ЗаписатьНовоеЗначениеКонстанты("ПерезаписатьНапоминания",истина);
		закрыть();
	исключение
		сообщить("Ошибка при процедуре удаления напоминаний на клиенте");
		сообщить(ОписаниеОшибки());
	КонецПопытки;
	Оповестить("Добавление элемента в раздел",Запись.Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)//Ден  2016 10 14 ---
	//Оповестить("ПерезаписьНапоминаний");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)//Ден  2016 10 21 ---
	#Если МобильноеПриложениеКлиент Тогда
		Если не ЗначениеЗаполнено(запись.ДатаНапоминания) Тогда
			этаформа.ТекущийЭлемент = элементы.ДатаНапоминания;
			НачатьРедактированиеЭлемента();
		КонецЕсли;
	#КонецЕсли
	Если ЗначениеЗаполнено(запись.Периодичность) Тогда
		Периодическое = истина;
		элементы.ГруппаНапоминания.Видимость = истина;
	КонецЕсли;
	элементы.ЭлементГиперссылка.Заголовок = "Элемент - " + строка(запись.Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПериодическоеПриИзменении(Элемент)//Ден  2016 10 24 ---
	Если Периодическое Тогда
		элементы.ГруппаНапоминания.Видимость = истина;
		запись.ВремяНапоминания = запись.ДатаНапоминания;
	Иначе
		элементы.ГруппаНапоминания.Видимость = ложь;
		запись.Периодичность = "";
		запись.ВремяНапоминания = дата(1,1,1);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)//Ден  2016 10 24 ---
	Если Периодическое Тогда	
		Если запись.Периодичность = "" Тогда
			Отказ = истина;
			сообщить("Необходимо указать периодичность!");
		КонецЕсли;
		Если запись.ИзначальнаяДата = дата(1,1,1) Тогда
			запись.ИзначальнаяДата = запись.ДатаНапоминания;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭлементГиперссылкаНажатие(Элемент)//Ден  2016 11 05
	ОткрытьФорму("Справочник.ЭлементыДоски.ФормаОбъекта",новый Структура("Ключ",запись.Элемент));
КонецПроцедуры


&НаКлиенте
Процедура Отложить(Команда)//Ден  2016 12 10
	Если Команда.Имя = "ОтложитьНаЧас" Тогда
		запись.ДатаНапоминания = запись.ДатаНапоминания + 3600;	
	ИначеЕсли Команда.Имя = "ОтложитьНаЗавтра" Тогда
		запись.ДатаНапоминания = запись.ДатаНапоминания + 24*3600;
	ИначеЕсли Команда.Имя = "ОтложитьНаПолезавтра" Тогда
		запись.ДатаНапоминания = запись.ДатаНапоминания + 48*3600;
	ИначеЕсли Команда.Имя = "ОтложитьНаНеделю" Тогда
		запись.ДатаНапоминания = запись.ДатаНапоминания + 7*24*3600;
	КонецЕсли;	
КонецПроцедуры

