
Процедура ПередЗаписью(Отказ)
	ДоскаДанногоНомера = Справочники.Доски.НайтиПоРеквизиту("НомерДоски",НомерДоски);
	Если не ДоскаДанногоНомера.Пустая() и ДоскаДанногоНомера <> Ссылка Тогда
		Сообщить("Данный номер уже используется для другой доски");
		Отказ = истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ВыборкаРазделов = Справочники.Разделы.Выбрать(,Ссылка);
	пока ВыборкаРазделов.Следующий() цикл
		РазделОб = ВыборкаРазделов.Ссылка.ПолучитьОбъект();
		РазделОб.Удалить();
	КонецЦикла;
КонецПроцедуры
