
Процедура ПередЗаписью(Отказ)//Ден  2016 10 14
	ДоскаДанногоНомера = Справочники.Доски.НайтиПоРеквизиту("НомерДоски",НомерДоски);
	Если не ДоскаДанногоНомера.Пустая() и ДоскаДанногоНомера <> Ссылка Тогда
		сообщить("Данный номер уже используется для другой доски");
		Отказ = истина;
	КонецЕсли;
КонецПроцедуры


Процедура ПередУдалением(Отказ)//Ден  2016 10 17 ---
	ВыборкаРазделов = Справочники.Разделы.Выбрать(,Ссылка);
	пока ВыборкаРазделов.Следующий() цикл
		РазделОб = ВыборкаРазделов.Ссылка.ПолучитьОбъект();
		РазделОб.Удалить();
	КонецЦикла;
КонецПроцедуры
